#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.db.random_password.master_password[0]: Refreshing state... [id=none]
aws_ecs_task_definition.service-one: Refreshing state... [id=service]
module.db.module.db_instance.aws_cloudwatch_log_group.this["postgresql"]: Refreshing state... [id=/aws/rds/instance/walrus/postgresql]
module.db.module.db_instance.aws_cloudwatch_log_group.this["upgrade"]: Refreshing state... [id=/aws/rds/instance/walrus/upgrade]
module.ecs.aws_ecs_cluster.this[0]: Refreshing state... [id=arn:aws:ecs:us-east-1:503785885773:cluster/services]
module.db.module.db_instance.data.aws_partition.current: Reading...
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Reading...
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-03658741f5918fb57]
module.db.module.db_parameter_group.aws_db_parameter_group.this[0]: Refreshing state... [id=walrus-20220523012639903700000001]
data.aws_availability_zones.available: Reading...
module.db.module.db_instance.data.aws_partition.current: Read complete after 0s [id=aws]
module.db.module.db_instance.data.aws_iam_policy_document.enhanced_monitoring: Read complete after 0s [id=1813475199]
module.db.module.db_instance.aws_iam_role.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role]
data.aws_availability_zones.available: Read complete after 0s [id=us-east-1]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0cdb7c6bae83ff284]
module.ecs.aws_ecs_cluster_capacity_providers.this[0]: Refreshing state... [id=services]
module.public_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0156301221b3c0545]
aws_lb_target_group.service-one: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:503785885773:targetgroup/service-one-alb/f1f1202a83791e03]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0715e4d78c52fc3e0]
module.vpc.aws_subnet.database[1]: Refreshing state... [id=subnet-0effde8811128a38f]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-020aeb341a77fbba5]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-016318e97eaf66d70]
module.vpc.aws_subnet.database[2]: Refreshing state... [id=subnet-07d2b35e24142037f]
module.vpc.aws_subnet.database[0]: Refreshing state... [id=subnet-0b6e8708fe39e937f]
module.database_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0244649399e24d70a]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0d1c7ea04cfa4b263]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0d2618294a64faadc]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-02859551d2e2c63b7]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-084c9a90a75edc8e5]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-05116a411584b8ac3]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0548a21d15614c9b7]
module.vpc.aws_subnet.elasticache[0]: Refreshing state... [id=subnet-0417a28458df7ad5d]
module.vpc.aws_subnet.elasticache[1]: Refreshing state... [id=subnet-0e3b2ef00e63f4617]
module.vpc.aws_subnet.elasticache[2]: Refreshing state... [id=subnet-015d99b45a1e9e2cd]
module.service_one_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-06734de9007d75a5e]
module.aws_elasticache_security_group.aws_security_group.this_name_prefix[0]: Refreshing state... [id=sg-0a59b42b291aa32c9]
module.vpc.aws_db_subnet_group.database[0]: Refreshing state... [id=dev-vpc]
module.db.module.db_instance.aws_iam_role_policy_attachment.enhanced_monitoring[0]: Refreshing state... [id=rds-monitoring-role-20220523012640679700000002]
module.public_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-76224381]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-0a0460c5c9bdf0810]
module.public_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1610459734]
module.database_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-774253221]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0ab44b2099b65e206]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05f41c1bc0037ff44]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0f43920bb2067bfba]
module.vpc.aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-0490988424dba8bb4]
module.vpc.aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-080c09fbd1d4c3fd1]
module.vpc.aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-03cd41250ed8711af]
module.vpc.aws_route_table_association.elasticache[0]: Refreshing state... [id=rtbassoc-0e22aa58ee6a40539]
module.vpc.aws_route_table_association.elasticache[1]: Refreshing state... [id=rtbassoc-04f01c6c2c5798d1b]
module.vpc.aws_route_table_association.elasticache[2]: Refreshing state... [id=rtbassoc-012390a747a52c123]
module.vpc.aws_elasticache_subnet_group.elasticache[0]: Refreshing state... [id=dev-vpc]
module.database_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1930661799]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0548a21d15614c9b71080289494]
module.aws_elasticache_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-1037194798]
aws_lb.service-one: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:503785885773:loadbalancer/app/service-one-alb/3891e5adfcafefc9]
module.service_one_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1456900903]
module.service_one_security_group.aws_security_group_rule.egress_rules[0]: Refreshing state... [id=sgrule-2505114334]
module.aws_elasticache_security_group.aws_security_group_rule.ingress_with_cidr_blocks[0]: Refreshing state... [id=sgrule-1484257344]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0d2618294a64faadc1080289494]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-00a03aa96037635d3]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0b904a684e801ac8f]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0af2498eb1079ea7e]
aws_ecs_service.service-one: Refreshing state... [id=arn:aws:ecs:us-east-1:503785885773:service/services/service-one]
module.db.module.db_instance.aws_db_instance.this[0]: Refreshing state... [id=walrus]
aws_lb_listener.service-one: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:503785885773:listener/app/service-one-alb/3891e5adfcafefc9/36fade12aba1bfe8]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_elasticache_cluster.redis-node will be created
  + resource "aws_elasticache_cluster" "redis-node" {
      + apply_immediately          = (known after apply)
      + arn                        = (known after apply)
      + auto_minor_version_upgrade = "true"
      + availability_zone          = (known after apply)
      + az_mode                    = (known after apply)
      + cache_nodes                = (known after apply)
      + cluster_address            = (known after apply)
      + cluster_id                 = "redis-cluster"
      + configuration_endpoint     = (known after apply)
      + engine                     = "redis"
      + engine_version             = "6.2"
      + engine_version_actual      = (known after apply)
      + id                         = (known after apply)
      + maintenance_window         = (known after apply)
      + node_type                  = "cache.t4g.micro"
      + num_cache_nodes            = 1
      + parameter_group_name       = "default.redis6.2"
      + port                       = 6379
      + replication_group_id       = (known after apply)
      + security_group_ids         = [
          + "sg-0a59b42b291aa32c9",
        ]
      + security_group_names       = (known after apply)
      + snapshot_window            = (known after apply)
      + subnet_group_name          = "redis-cluster-cache-subnet"
      + tags_all                   = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
    }

  # aws_elasticache_subnet_group.redis-node will be created
  + resource "aws_elasticache_subnet_group" "redis-node" {
      + arn         = (known after apply)
      + description = "Managed by Terraform"
      + id          = (known after apply)
      + name        = "redis-cluster-cache-subnet"
      + subnet_ids  = [
          + "subnet-015d99b45a1e9e2cd",
          + "subnet-0417a28458df7ad5d",
          + "subnet-0e3b2ef00e63f4617",
        ]
      + tags_all    = {
          + "Environment"      = "Development"
          + "TerraformManaged" = "True"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Redundant ignore_changes element

  on .terraform/modules/db/modules/db_instance/main.tf line 26, in resource "aws_db_instance" "this":
  26: resource "aws_db_instance" "this" {

Adding an attribute name to ignore_changes tells Terraform to ignore future
changes to the argument in configuration after the object has been created,
retaining the value originally configured.

The attribute latest_restorable_time is decided by the provider alone and
therefore there can be no configured value to compare with. Including this
attribute in ignore_changes has no effect. Remove the attribute from
ignore_changes to quiet this warning.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @csepulveda, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform`*